{
  "slug": "structured-house",
  "title": "Structured House",
  "instructions": "Your task is to use variables to build the house.\n\nChange all the inputs in the functions to use variables.\n\nSet all the variables at the top before the first functions are used. We've set the first few to get you started.\n\nEvery variable should either be:\n\n- A number that is specified in the instructions (e.g. the height of the frame); or\n- A formula between two variables (e.g. `set roof_left to house_left - roof_overhang`) or a variable and a number specified in the instructions (e.g. `set door_knob_right to door_right - 1`).\n\nDo **not** manually set variables to numbers you've calculated yourself (e.g. DO NOT set `roof_left = 16`)\n\nThe purpose of this exercise is to push you towards structured, ordered thinking. Take your time.\n\nAs a reminder, the house should continue to look like this:\n\n![Structured House](https://assets.exercism.org/bootcamp/graphics/jumbled-house-finished.png)\n\n### House Instructions\n\n- The top-left of the drawing canvas is `0,0`. The bottom-right is `100,100`.\n- The sky fills the canvas (from `0,0` to `100,100`).\n- The grass is full width (from `0` to `100`) sits on the bottom of the canvas at `100` with a height of `20`.\n- The frame of the house (the big rectangle) should be 60 wide and 40 height. It should have its top-left corner at 20x50.\n- The roof sits snugly on top of the house's frame. It should overhang the left and right of the house by 4 on each side. It should have a height of 20, and its point should be centered horizontally (50).\n- The windows are both the same size, with a width of 12 and a height of 13. They both sit 5 from the top of the house frame, and 10 inset from the sides.\n- The door is 14 wide and 18 tall, and sits at the bottom of the house in the center.\n- The little door knob has a radius of 1, is inset 1 from the right, and is vertically centered in the door.\n\n### Functions\n\nThe house uses the following functions:\n\n- `circle(x, y, radius, color)`\n- `rectangle(x, y, width, height, color)`\n- `ellipse(center_x, center_y, radius_x, radius_y, color)`\n- `triangle(x1,y1, x2,y2, x3,y3, color)`",
  "estimatedMinutes": 20,
  "levelId": "everything",
  "hints": [
    "Define all variables at the top of your code before any drawing functions",
    "Use formulas to calculate derived values (e.g. roof_left = house_left - roof_overhang)",
    "Don't hard-code calculated values - let the formulas do the work",
    "Colors should also be stored in variables",
    "Window positions can be calculated from house_left and window insets"
  ]
}
