{
  "slug": "jumbled-house",
  "title": "Jumbled House",
  "instructions": "Your task is to rearrange the pieces of the house. They are both misplaced and the wrong sizes.\n\nThe purpose of this exercise is to encourage your slow, meticulous thinking. You should be able to solve this whole exercise by carefully working through the instructions without guessing at any numbers. Take your time.\n\nTry and place each piece in the order they're listed below. When everything is correct you should have a scene that looks like this:\n\n![Jumbled House](https://assets.exercism.org/bootcamp/graphics/jumbled-house-finished.png)\n\n### Instructions\n\n- The top-left of the canvas is `0,0`. The bottom-right is `100,100`.\n- The frame of the house (the big rectangle) should be 60 wide and 40 height. It should have its top-left corner at 20x50.\n- The roof sits snugly on top of the house's frame. It should overhang the left and right of the house by 4 on each side. It should have a height of 20, and its point should be centered horizontally.\n- The windows are both the same size, with a width of 12 and a height of 13. They both sit 5 from the top of the house frame, and 10 inset from the sides.\n- The door is 14 wide and 18 tall, and sits at the bottom of the house in the center.\n- The little door knob has a radius of 1, is inset 1 from the right, and is vertically centered in the door.\n\n### Functions\n\nThe house uses the following functions:\n\n- `circle(x, y, radius)`\n- `rectangle(x, y, width, height)`\n- `ellipse(center_x, center_y, radius_x, radius_y)`\n- `triangle(x1,y1, x2,y2, x3,y3)`\n- `fill_color_hex(hex)`",
  "estimatedMinutes": 15,
  "levelId": "everything",
  "hints": [
    "Work through each shape in order - sky, grass, house frame, roof, windows, door, knob",
    "The canvas coordinates go from (0,0) at top-left to (100,100) at bottom-right",
    "For the roof triangle: the left point is at x=16 (house at 20 minus 4 overhang), the right at x=84",
    "The windows sit 5 down from the top of the house frame (y=55), and 10 in from the edges",
    "The door is centered horizontally: house starts at x=20, is 60 wide, door is 14 wide, so door x = 20 + (60-14)/2 = 43"
  ]
}
